# --------------------------------------------------------------------------------
# Лабораторная работа №1 по дисциплине "Логические основы интеллектуальных систем"
# Выполнена студентами группы 121701 БГУИР:
#  - Липский Ростислав Владимирович
#  - Олешкевич Алексей Сергеевич
#  - Смольник Владислав Андреевич
#
#


TESTS = [
    (r"A", True),
    (r"A12", True),
    (r"T", True),
    (r".L", True),
    (r"(!A)", True),
    (r"((A/\((!B)/\(!C)))\/((!D)/\(E/\F)))", True),
    (r"((A/\B)\/C)", True),
    (r"(A\/B)", True),
    (r'(A\/(B/\(C\/D)))', False),
    (r"(a\/b)", True),
    (r"((a\/b)\/c)", True),
    (r"(a\/(b\/c))", True),
    (r"(!(A\/B))", False),
    (r"(А\/В)", True),
    (r"((А/\В)\/(А/\С))", True),
    (r"((А/\В)\/((В/\С)\/((А/\С)/\В)))", True),
    (r"(((A/\C)/\D)\/(((A/\B)/\(B/\C))/\D))", True),
    (r"(!(А\/В))", False),
    (r"(!((A/\C)/\D)\/(((A/\B)/\(B/\C))/\D))", False),
    (r"((А\/В)/\((В/\С)/\((А/\С)/\В)))", RuntimeError),
    (r"A/\B/\C", RuntimeError),
    (r"(A \/ B)", RuntimeError),
    (r"(A)", RuntimeError),
    (r"A\/B", RuntimeError),
]
